app/controllers/posts_controller.rb

INSERT INTO "posts" ("content", "created_at", "updated_at") VALUES (?, ?, ?) RETURNING "id"  [["content", "asdfg"], ["created_at", "2024-01-16 08:46:40.935309"], ["updated_at", "2024-01-16 08:46:40.935309"]]
---
  def create
    @post = Post.new(content: params[:content])
    if
      @post.save